import pandas as pd
from sklearn.model_selection import train_test_split


def preprocess(dataset_path):
    df = pd.read_excel(dataset_path)
    df['Раса'] = df['Раса'].replace({'Другая': 0, 'Азиатская': 1, 'Европейская': 2})
    df['Пол'] = df['Пол'].replace({'Женский': 0, 'Мужской': 1})
    df['Возраст'] = df['Возраст'].replace({'До 70': 0, 'После 70': 1})
    df['Статус курения'] = df['Статус курения'].replace(
        {'В настоящее время': 0, 'Курение в прошлом (бросил более 1 года)': 1,
         'Курение в прошлом (бросил более 1 месяца до 1 года)': 2})
    df['ECOG'] = df['ECOG'].replace({'0-1': 0, '2': 1})
    df['Есть опухолевая нагрузка? (симптомная опухоль)'] = df['Есть опухолевая нагрузка? (симптомная опухоль)'].replace(
        {'Да': 0, 'Нет': 1})
    df['Ко-мутации KRAS'] = df['Ко-мутации KRAS'].replace({'Да': 0, 'Нет': 1})
    df['Ко-мутации p53.'] = df['Ко-мутации p53.'].replace({'Да': 0, 'Нет': 1})
    df['Ко-мутации STK11'] = df['Ко-мутации STK11'].replace({'Да': 0, 'Нет': 1})
    df['Ко-мутации KEAP1'] = df['Ко-мутации KEAP1'].replace({'Да': 0, 'Нет': 1})
    df['Срок от окончания ХЛТ'] = df['Срок от окончания ХЛТ'].replace(
        {'До 42 дней': 0, 'От 43 до 60 дней': 1, 'Более 61 дня': 2})
    df['Молекулярный статус (только для неплоскоклеточного рака)'] = df[
        'Молекулярный статус (только для неплоскоклеточного рака)'].replace(
        {'ALK позитивный': 0, 'EGFR ex19': 1, 'EGFR ex21': 2, 'EGFR редкий вариант': 3,
         'Не исследовался': 4, 'Нет мутаций': 5})
    df['PD-L1 статус'] = df['PD-L1 статус'].replace({'Более 1%': 0, 'Менее 1%': 1, 'Не исследовался': 2})
    df['Предпочтение пациента по ответу на терапию'] = df['Предпочтение пациента по ответу на терапию'].replace(
        {'Результативность лечения': 0, 'Сохранение качества жизни': 1})
    df['Ответ эксперта (Лактионов)'] = df['Ответ эксперта (Лактионов)'].replace(
        {'Алектиниб': 0, 'Дурвалумаб': 1, 'Наблюдение': 2, 'Осимертиниб': 3})
    df['Уверенность в рекомендации'] = df['Уверенность в рекомендации'].replace(
        {'50%': 0, '75%': 1, '100%': 2})
    df['Альтернатива'] = df['Альтернатива'].replace(
        {'Алектиниб': 0, 'Дурвалумаб': 1, 'Наблюдение': 2, 'Нет': 3, 'Осимертиниб':4})

    x = df[df.columns[1:15]]
    y = df[df.columns[15:18]]
    x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.1, shuffle=True, random_state=42)
    return x_train, x_test, y_train, y_test

